jacob-heathorn/mimxrt1170evk/firmware/cm7/drivers/fsl_lpuart.c
    if (tmpRxRingBufferTail > tmpRxRingBufferHead)
    {
        size = ((size_t)tmpRxRingBufferHead + tmpRxRingBufferSize - (size_t)tmpRxRingBufferTail);
    }
    else
    {
        size = ((size_t)tmpRxRingBufferHead - (size_t)tmpRxRingBufferTail);
    }

    return size;
}

static bool LPUART_TransferIsRxRingBufferFull(LPUART_Type *base, lpuart_handle_t *handle)
{
    assert(NULL != handle);

    bool full;

    if (LPUART_TransferGetRxRingBufferLength(base, handle) == (handle->rxRingBufferSize - 1U))
    {
        full = true;
    }
    else
    {
        full = false;
    }
    return full;
}

static void LPUART_WriteNonBlocking(LPUART_Type *base, const uint8_t *data, size_t length)
{
    assert(NULL != data);

    size_t i;

    /* The Non Blocking write data API assume user have ensured there is enough space in
    peripheral to write. */
    for (i = 0; i < length; i++)
    {
        base->DATA = data[i];
    }
}

static void LPUART_ReadNonBlocking(LPUART_Type *base, uint8_t *data, size_t length)
{
    assert(NULL != data);

    size_t i;
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
    uint32_t ctrl        = base->CTRL;
    bool isSevenDataBits = (((ctrl & LPUART_CTRL_M7_MASK) != 0U) ||
                            (((ctrl & LPUART_CTRL_M_MASK) == 0U) && ((ctrl & LPUART_CTRL_PE_MASK) != 0U)));
#endif

    /* The Non Blocking read data API assume user have ensured there is enough space in
    peripheral to write. */
    for (i = 0; i < length; i++)
    {
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
        if (isSevenDataBits)
        {
            data[i] = (uint8_t)(base->DATA & 0x7FU);
        }
        else
        {
            data[i] = (uint8_t)base->DATA;
        }
#else
        data[i] = (uint8_t)(base->DATA);
#endif
    }
}

/*!
 * brief Initializes an LPUART instance with the user configuration structure and the peripheral clock.
 *
 * This function configures the LPUART module with user-defined settings. Call the LPUART_GetDefaultConfig() function
 * to configure the configuration structure and get the default configuration.
 * The example below shows how to use this API to configure the LPUART.
 * code
 *  lpuart_config_t lpuartConfig;
 *  lpuartConfig.baudRate_Bps = 115200U;
 *  lpuartConfig.parityMode = kLPUART_ParityDisabled;
 *  lpuartConfig.dataBitsCount = kLPUART_EightDataBits;
 *  lpuartConfig.isMsb = false;
 *  lpuartConfig.stopBitCount = kLPUART_OneStopBit;
 *  lpuartConfig.txFifoWatermark = 0;
 *  lpuartConfig.rxFifoWatermark = 1;
 *  LPUART_Init(LPUART1, &lpuartConfig, 20000000U);
 * endcode
 *
 * param base LPUART peripheral base address.
 * param config Pointer to a user-defined configuration structure.
 * param srcClock_Hz LPUART clock source frequency in HZ.
 * retval kStatus_LPUART_BaudrateNotSupport Baudrate is not support in current clock source.
 * retval kStatus_Success LPUART initialize succeed
 */
status_t LPUART_Init(LPUART_Type *base, const lpuart_config_t *config, uint32_t srcClock_Hz)
{
    assert(NULL != config);
    assert(0U < config->baudRate_Bps);
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    assert((uint8_t)FSL_FEATURE_LPUART_FIFO_SIZEn(base) > config->txFifoWatermark);
    assert((uint8_t)FSL_FEATURE_LPUART_FIFO_SIZEn(base) > config->rxFifoWatermark);
#endif

    status_t status = kStatus_Success;
//     uint32_t temp;
//     uint16_t sbr, sbrTemp;
//     uint8_t osr, osrTemp;
//     uint32_t tempDiff, calculatedBaud, baudDiff;

//     /* This LPUART instantiation uses a slightly different baud rate calculation
//      * The idea is to use the best OSR (over-sampling rate) possible
//      * Note, OSR is typically hard-set to 16 in other LPUART instantiations
//      * loop to find the best OSR value possible, one that generates minimum baudDiff
//      * iterate through the rest of the supported values of OSR */

//     baudDiff = config->baudRate_Bps;
//     osr      = 0U;
//     sbr      = 0U;
//     for (osrTemp = 4U; osrTemp <= 32U; osrTemp++)
//     {
//         /* calculate the temporary sbr value   */
//         sbrTemp = (uint16_t)((srcClock_Hz * 10U / (config->baudRate_Bps * (uint32_t)osrTemp) + 5U) / 10U);
//         /*set sbrTemp to 1 if the sourceClockInHz can not satisfy the desired baud rate*/
//         if (sbrTemp == 0U)
//         {
//             sbrTemp = 1U;
//         }
// 		else if (sbrTemp > LPUART_BAUD_SBR_MASK)
//         {
//             sbrTemp = LPUART_BAUD_SBR_MASK;
//         }
//         else
//         {
//             /* Avoid MISRA 15.7 */
//         }
//         /* Calculate the baud rate based on the temporary OSR and SBR values */
//         calculatedBaud = (srcClock_Hz / ((uint32_t)osrTemp * (uint32_t)sbrTemp));
//         tempDiff       = calculatedBaud > config->baudRate_Bps ? (calculatedBaud - config->baudRate_Bps) :
//                                                            (config->baudRate_Bps - calculatedBaud);

//         if (tempDiff <= baudDiff)
//         {
//             baudDiff = tempDiff;
//             osr      = osrTemp; /* update and store the best OSR value calculated */
//             sbr      = sbrTemp; /* update store the best SBR value calculated */
//         }
//     }

//     /* Check to see if actual baud rate is within 3% of desired baud rate
//      * based on the best calculate OSR value */
//     if (baudDiff > ((config->baudRate_Bps / 100U) * 3U))
//     {
//         /* Unacceptable baud rate difference of more than 3%*/
//         status = kStatus_LPUART_BaudrateNotSupport;
//     }
//     else
//     {
// #if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)

//         // uint32_t instance = LPUART_GetInstance(base);

//         /* Enable lpuart clock */
// //         (void)CLOCK_EnableClock(s_lpuartClock[instance]);
// // #if defined(LPUART_PERIPH_CLOCKS)
// //         (void)CLOCK_EnableClock(s_lpuartPeriphClocks[instance]);
// // #endif

// #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

// #if defined(FSL_FEATURE_LPUART_HAS_GLOBAL) && FSL_FEATURE_LPUART_HAS_GLOBAL
//         /*Reset all internal logic and registers, except the Global Register */
//         LPUART_SoftwareReset(base);
// #else
//         /* Disable LPUART TX RX before setting. */
//         base->CTRL &= ~(LPUART_CTRL_TE_MASK | LPUART_CTRL_RE_MASK);
// #endif

//         temp = base->BAUD;

//         /* Acceptable baud rate, check if OSR is between 4x and 7x oversampling.
//          * If so, then "BOTHEDGE" sampling must be turned on */
//         /*
//          * $Branch Coverage Justification$
//          * $ref fsl_lpuart_c_ref_1$
//          */
//         if ((osr > 3U) && (osr < 8U))
//         {
//             temp |= LPUART_BAUD_BOTHEDGE_MASK;
//         }

