jacob-heathorn/mimxrt1170evk/firmware/cm7/drivers/fsl_lpuart.c
//         /* program the osr value (bit value is one less than actual value) */
//         temp &= ~LPUART_BAUD_OSR_MASK;
//         temp |= LPUART_BAUD_OSR((uint32_t)osr - 1UL);

//         /* write the sbr value to the BAUD registers */
//         temp &= ~LPUART_BAUD_SBR_MASK;
//         base->BAUD = temp | LPUART_BAUD_SBR(sbr);

//         /* Set bit count and parity mode. */
//         base->BAUD &= ~LPUART_BAUD_M10_MASK;

//         temp = base->CTRL & ~(LPUART_CTRL_PE_MASK | LPUART_CTRL_PT_MASK | LPUART_CTRL_M_MASK | LPUART_CTRL_ILT_MASK |
//                               LPUART_CTRL_IDLECFG_MASK);

//         temp |= (uint8_t)config->parityMode | LPUART_CTRL_IDLECFG(config->rxIdleConfig) |
//                 LPUART_CTRL_ILT(config->rxIdleType);

// #if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
//         if (kLPUART_SevenDataBits == config->dataBitsCount)
//         {
//             if (kLPUART_ParityDisabled != config->parityMode)
//             {
//                 temp &= ~LPUART_CTRL_M7_MASK; /* Seven data bits and one parity bit */
//             }
//             else
//             {
//                 temp |= LPUART_CTRL_M7_MASK;
//             }
//         }
//         else
// #endif
//         {
//             if (kLPUART_ParityDisabled != config->parityMode)
//             {
//                 temp |= LPUART_CTRL_M_MASK; /* Eight data bits and one parity bit */
//             }
//         }

//         base->CTRL = temp;

// #if defined(FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT) && FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT
//         /* set stop bit per char */
//         temp       = base->BAUD & ~LPUART_BAUD_SBNS_MASK;
//         base->BAUD = temp | LPUART_BAUD_SBNS((uint8_t)config->stopBitCount);
// #endif

// #if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
//         /* Set tx/rx WATER watermark
//            Note:
//            Take care of the RX FIFO, RX interrupt request only assert when received bytes
//            equal or more than RX water mark, there is potential issue if RX water
//            mark larger than 1.
//            For example, if RX FIFO water mark is 2, upper layer needs 5 bytes and
//            5 bytes are received. the last byte will be saved in FIFO but not trigger
//            RX interrupt because the water mark is 2.
//          */
//         base->WATER = (((uint32_t)(config->rxFifoWatermark) << 16U) | config->txFifoWatermark);

//         /* Enable tx/rx FIFO */
//         base->FIFO |= (LPUART_FIFO_TXFE_MASK | LPUART_FIFO_RXFE_MASK);

//         /* Flush FIFO */
//         base->FIFO |= (LPUART_FIFO_TXFLUSH_MASK | LPUART_FIFO_RXFLUSH_MASK);
// #endif

//         /* Clear all status flags */
//         temp = (LPUART_STAT_RXEDGIF_MASK | LPUART_STAT_IDLE_MASK | LPUART_STAT_OR_MASK | LPUART_STAT_NF_MASK |
//                 LPUART_STAT_FE_MASK | LPUART_STAT_PF_MASK);

// #if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
//         temp |= LPUART_STAT_LBKDIF_MASK;
// #endif

// #if defined(FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING) && FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
//         temp |= (LPUART_STAT_MA1F_MASK | LPUART_STAT_MA2F_MASK);
// #endif

// #if defined(FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT) && FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
//         /* Set the CTS configuration/TX CTS source. */
//         base->MODIR |= LPUART_MODIR_TXCTSC(config->txCtsConfig) | LPUART_MODIR_TXCTSSRC(config->txCtsSource);
//         if (true == config->enableRxRTS)
//         {
//             /* Enable the receiver RTS(request-to-send) function. */
//             base->MODIR |= LPUART_MODIR_RXRTSE_MASK;
//         }
//         if (true == config->enableTxCTS)
//         {
//             /* Enable the CTS(clear-to-send) function. */
//             base->MODIR |= LPUART_MODIR_TXCTSE_MASK;
//         }
// #endif

//         /* Set data bits order. */
//         if (true == config->isMsb)
//         {
//             temp |= LPUART_STAT_MSBF_MASK;
//         }
//         else
//         {
//             temp &= ~LPUART_STAT_MSBF_MASK;
//         }

//         base->STAT |= temp;

//         /* Enable TX/RX base on configure structure. */
//         temp = base->CTRL;
//         if (true == config->enableTx)
//         {
//             temp |= LPUART_CTRL_TE_MASK;
//         }

//         if (true == config->enableRx)
//         {
//             temp |= LPUART_CTRL_RE_MASK;
//         }

//         base->CTRL = temp;
    // }
    // (void)temp; (void)sbr; (void)osr;
    return status;
}
/*!
 * brief Deinitializes a LPUART instance.
 *
 * This function waits for transmit to complete, disables TX and RX, and disables the LPUART clock.
 *
 * param base LPUART peripheral base address.
 */
void LPUART_Deinit(LPUART_Type *base)
{
    uint32_t temp;

#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    /* Wait tx FIFO send out*/
    while (0U != ((base->WATER & LPUART_WATER_TXCOUNT_MASK) >> LPUART_WATER_TXWATER_SHIFT))
    {
    }
#endif
    /* Wait last char shift out */
    while (0U == (base->STAT & LPUART_STAT_TC_MASK))
    {
    }

    /* Clear all status flags */
    temp = (LPUART_STAT_RXEDGIF_MASK | LPUART_STAT_IDLE_MASK | LPUART_STAT_OR_MASK | LPUART_STAT_NF_MASK |
            LPUART_STAT_FE_MASK | LPUART_STAT_PF_MASK);

#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
    temp |= LPUART_STAT_LBKDIF_MASK;
#endif

#if defined(FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING) && FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
    temp |= (LPUART_STAT_MA1F_MASK | LPUART_STAT_MA2F_MASK);
#endif

    base->STAT |= temp;

    /* Disable the module. */
    base->CTRL = 0U;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    uint32_t instance = LPUART_GetInstance(base);

    /* Disable lpuart clock */
    (void)CLOCK_DisableClock(s_lpuartClock[instance]);

#if defined(LPUART_PERIPH_CLOCKS)
    (void)CLOCK_DisableClock(s_lpuartPeriphClocks[instance]);
#endif

#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Gets the default configuration structure.
 *
 * This function initializes the LPUART configuration structure to a default value. The default
 * values are:
 *   lpuartConfig->baudRate_Bps = 115200U;
 *   lpuartConfig->parityMode = kLPUART_ParityDisabled;
 *   lpuartConfig->dataBitsCount = kLPUART_EightDataBits;
 *   lpuartConfig->isMsb = false;
 *   lpuartConfig->stopBitCount = kLPUART_OneStopBit;
 *   lpuartConfig->txFifoWatermark = 0;
 *   lpuartConfig->rxFifoWatermark = 1;
 *   lpuartConfig->rxIdleType = kLPUART_IdleTypeStartBit;
 *   lpuartConfig->rxIdleConfig = kLPUART_IdleCharacter1;
 *   lpuartConfig->enableTx = false;
 *   lpuartConfig->enableRx = false;
 *
 * param config Pointer to a configuration structure.
 */
void LPUART_GetDefaultConfig(lpuart_config_t *config)
{
    assert(NULL != config);

    /* Initializes the configure structure to zero. */
    (void)memset(config, 0, sizeof(*config));

    config->baudRate_Bps  = 115200U;
    config->parityMode    = kLPUART_ParityDisabled;
    config->dataBitsCount = kLPUART_EightDataBits;
    config->isMsb         = false;
#if defined(FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT) && FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT
    config->stopBitCount = kLPUART_OneStopBit;
#endif
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    config->txFifoWatermark = 0U;
    config->rxFifoWatermark = 0U;
#endif
#if defined(FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT) && FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
    config->enableRxRTS = false;
    config->enableTxCTS = false;
    config->txCtsConfig = kLPUART_CtsSampleAtStart;
    config->txCtsSource = kLPUART_CtsSourcePin;
#endif
    config->rxIdleType   = kLPUART_IdleTypeStartBit;
    config->rxIdleConfig = kLPUART_IdleCharacter1;
    config->enableTx     = false;
    config->enableRx     = false;
}

/*!
 * brief Sets the LPUART instance baudrate.
 *
 * This function configures the LPUART module baudrate. This function is used to update
 * the LPUART module baudrate after the LPUART module is initialized by the LPUART_Init.
 * code
 *  LPUART_SetBaudRate(LPUART1, 115200U, 20000000U);
 * endcode
 *
 * param base LPUART peripheral base address.
 * param baudRate_Bps LPUART baudrate to be set.
 * param srcClock_Hz LPUART clock source frequency in HZ.
 * retval kStatus_LPUART_BaudrateNotSupport Baudrate is not supported in the current clock source.
 * retval kStatus_Success Set baudrate succeeded.
 */
status_t LPUART_SetBaudRate(LPUART_Type *base, uint32_t baudRate_Bps, uint32_t srcClock_Hz)
{
    assert(0U < baudRate_Bps);

